soap-query-examples/UpdateDocIndexes_DeleteIndexes.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:cyp="http://asg.com/cypress_wcfsvc_v73/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soapenv:Header />
	<soapenv:Body>
		<cyp:DeleteDocIndexes>
			<cyp:UserCredential>
				<cyp:CredentialType>UserIdPassword</cyp:CredentialType>
				<cyp:DomainName>molitor</cyp:DomainName>
				<cyp:UserName>srv_bdoc</cyp:UserName>
				<cyp:Password>28awuS+eBrEm</cyp:Password>
				<cyp:CypWsUserId />
				<cyp:CredentialData />
			</cyp:UserCredential>
			<!--Optional:-->
			<cyp:ReqDeleteDocInx>
				<cyp:DeleteActnList xsi:type="cyp:CwsDeleteIndexActn">
					<cyp:CwsDeleteIndexActn>
						<cyp:UseTempToCvtVals>false</cyp:UseTempToCvtVals>
						<cyp:UpdtScope>DocLevelUpdate</cyp:UpdtScope>
						<cyp:InxList>
							<cyp:CwsDelInxVal>
								<cyp:InxId>1026</cyp:InxId>
								<cyp:InxVal xsi:type="xsd:string">TOTO</cyp:InxVal>
							</cyp:CwsDelInxVal>
						</cyp:InxList>
						<cyp:TgtDocs>
							<cyp:DdocIds>
								<cyp:unsignedInt>23680</cyp:unsignedInt>
							</cyp:DdocIds>
						</cyp:TgtDocs>
					</cyp:CwsDeleteIndexActn>
				</cyp:DeleteActnList>
			</cyp:ReqDeleteDocInx>
		</cyp:DeleteDocIndexes>
	</soapenv:Body>
</soapenv:Envelope>

<!-- RESULTAT -->

<!-- 
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <DeleteDocIndexesResponse xmlns="http://asg.com/cypress_wcfsvc_v73/">
         <DeleteDocIndexesResult>
            <status>true</status>
         </DeleteDocIndexesResult>
      </DeleteDocIndexesResponse>
   </s:Body>
</s:Envelope>
 -->